Revit 2024 API
ScheduleFieldDisplayType Enumeration
 Display type of schedule field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Since: 2017
Syntax
C#
public enum ScheduleFieldDisplayType
Visual Basic
Public Enumeration ScheduleFieldDisplayType
Visual C++
public enum class ScheduleFieldDisplayType
Members
Member name | Description
Standard |  Standard: field setting for [!:Autodesk::Revit::DB::ScheduleField::MultipleValuesText] is displayed if the values of the elements are different, otherwise, the common value will be displayed
Totals |  Calculates and displays the total value
MinMax |  Calculates and displays the minimum and maximum values
Max |  Calculates and displays the maximum value
Min |  Calculates and displays the minimum value
See Also
Autodesk.Revit.DB Namespace